test/performance/products.yml
config:
  target: "https://good-erin-scarab-tutu.cyclic.app"
  phases:
    - duration: 2
      arrivalRate: 5
      name: Warm up
    - duration: 2
      arrivalRate: 10
      rampTo: 150
      name: Ramp up load
    - duration: 2
      arrivalRate: 3
      maxVusers: 20
      name: Sustained load

scenarios:
  - name: "Retrieve data"
    flow:
      - get:
          url: "/customers/103/products"